https://cloud.tencent.com/developer/article/1043460

以比特币为首的P2P虚拟货币颠覆了人们对货币的认知，也为网上交易提供了新的途径。近几年来，虚拟货币支付以其去中心化、匿名性等特点深受欢迎，活跃在各个领域，涵盖了电商、慈善组织、企业院校等合法机构，当然也包括了一些非法交易。本文将简单谈谈虚拟货币在域名注册上的使用。

一、域名注册的匿名支付需求

域名注册人购买域名大多是为了搭建网站或者个人博客。很多国外的域名注册商不需要客户实名认证，如果使用非匿名注册手段，客户的支付信息（如信用卡）对于注册商依然是透明的。如若注册商的服务器被黑客攻破，用户的信用卡信息就会被窃取并贩卖，进而被用于洗钱、诈骗等非法活动，危害用户的合法权益。而如今，虚拟货币为域名购买提供了更加安全的途径。

二、有哪些支持虚拟货币支付的域名注册商

经过不完全的搜集，本文统计了20余个目前支持比特币等虚拟货币作为支付手段的域名注册商。

1、  Namecheap

Namecheap是非常有名的域名注册和网站托管公司，始于2000年，拥有超过100万的客户，同时它也是于2013年3月率先接受比特币支付的主流域名注册商。


2、  HawkHost

HawkHost是知名的托管网站，同时也提供域名注册服务，在达拉斯、华盛顿、洛杉矶、阿姆斯特丹、荷兰和新加坡有6个数据中心，于2014年3月开始接受比特币支付。


3、  Gandi

Gandi位于法国，成立于1999年，声称是第一个被ICANN批准的域名注册商。它于2015年10月开始支持比特币支付。


目前支持的虚拟货币支付的域名注册商详见下表：


从地域上来看，美欧澳非的主流域名注册商基本都已接受虚拟货币的支付，暂未发现有亚洲的域名注册商支持。

从时间上来看，从2013年，即比特币开始大范围流行的时候开始，各大域名注册商逐渐开放了虚拟货币的支付。

从各国对比特币等虚拟货币的态度上来看，暂无国家明确将其认定为货币，但很多国家承认其合法地位并允许其用于交易市场。具体情况可以参考维基百科Legality of bitcoin by country词条。

三、虚拟货币支付的匿名性

虚拟货币支付保护了合法用户的身份隐私，避免了支付信息泄露造成用户的经济损失，但也有很多不法分子利用虚拟货币支付的匿名性购买域名，从事非法活动，使得网络安全人员和有关部门难以进行资金链的追踪溯源。其中最关键的问题是虚拟货币支付的匿名性。以下将对匿名性和相应追踪方法进行几点讨论。

以比特币为例。

1、匿名性是如何保证的

比特币钱包的注册不需要真实的身份信息，交易过程不存在中心机构，也不需要真实身份认证，只要拥有公钥（地址）和私钥（签名）就可以进行交易。
用户可以通过注册多个钱包地址来实现更高的匿名保障。比特币创始人中本聪也曾在原始的白皮书中建议用户每一次交易使用一个新地址，以免交易被链接到同一所有者。
用户可以利用Tor网络防止真实IP暴露。
2、匿名性的破绽及追踪手段

为了防止同一比特币被用于多个交易中，账本是透明公开并永久储存的，可以通过钱包地址查到该账户的所有交易记录。例如，在baockchain.info 这个网站中，输入地址、账号等信息，就能查到与其相关的所有交易记录。同一用户在自己的的多个钱包之间进行转账的行为也会被记录。一旦用户有一个真实信息与账户关联，那么该账户的匿名性将荡然无存。
用户难免要进行比特币与真实货币之间的兑换，在兑换过程中可能会涉及到真实身份。通过兑换环节的追踪，加以对钱包地址、活动记录等的大数据分析，也是一种追溯真实身份的方法。chainalysis就是一个这样一个工具，美国、欧盟和亚洲多地执法机构都借助它的追踪技术来调查比特币洗钱、毒品买卖等非法交易。
即使使用了Tor网络，也不能完全保证真实身份不暴露，只是要多付出一些代价。卢森堡大学于2014年发布的报告《比特币P2P网络中的客户端匿名化》中就指出了这个破绽。具体情况与Tor网络的安全性有关，在这里不进行详述。
可以说，虚拟货币支付的匿名性并不完美，只在一定的追溯成本范围内成立。
